ERP.belugaerp/src/Catalogs/ЕГАИСПрисоединенныеФайлы/ЕГАИСПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЕГАИСПрисоединенныеФайлы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_АдресДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаТикетаЕГАИС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СправкаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапроса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ЕГАИСПрисоединенныеФайлы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Список.ПроизвольныйЗапрос = Истина;
	Список.ОсновнаяТаблица = "Справочник.ЕГАИСПрисоединенныеФайлы";
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕГАИСПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ЕГАИСПрисоединенныеФайлы.ВерсияДанных КАК ВерсияДанных,
	|	ЕГАИСПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
	|	ЕГАИСПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ЕГАИСПрисоединенныеФайлы.Операция КАК Операция,
	|	ВЫБОР
	|		КОГДА ЕГАИСПрисоединенныеФайлы.Документ = НЕОПРЕДЕЛЕНО
	|				И НЕ ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС
	|		ИНАЧЕ ЕГАИСПрисоединенныеФайлы.Документ
	|	КОНЕЦ КАК Документ,
	|	ЕГАИСПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	ЕГАИСПрисоединенныеФайлы.ТипСообщения КАК ТипСообщения,
	|	ЕГАИСПрисоединенныеФайлы.ФорматОбмена КАК ФорматОбмена,
	|	ЕГАИСПрисоединенныеФайлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	|	ЕГАИСПрисоединенныеФайлы.бг_СправкаЕГАИС КАК бг_СправкаЕГАИС,
	|	ЕГАИСПрисоединенныеФайлы.Предопределенный КАК Предопределенный,
	|	ЕГАИСПрисоединенныеФайлы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЕГАИСПрисоединенныеФайлы.Представление КАК Представление
	|ИЗ
	|	Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы";
КонецПроцедуры

#КонецОбласти
